fio/results/libpmem_d32_cpu0_membind0_split.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqwrite: (g=2): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqread: (g=3): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 256MiB)
libpmem-randread: Laying out IO file (1 file / 256MiB)
libpmem-randread: Laying out IO file (1 file / 256MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 256MiB)
libpmem-seqread: Laying out IO file (1 file / 256MiB)
libpmem-seqread: Laying out IO file (1 file / 256MiB)
[...]
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=20038: Thu Apr 19 11:19:13 2018
   read: IOPS=8310k, BW=31.7GiB/s (34.0GB/s)(951GiB/30002msec)
    clat (nsec): min=119, max=100007k, avg=3194.39, stdev=115602.87
     lat (nsec): min=143, max=100007k, avg=3263.81, stdev=116725.79
    clat percentiles (nsec):
     |  1.00th=[  884],  5.00th=[ 1288], 10.00th=[ 1528], 20.00th=[ 1816],
     | 30.00th=[ 2008], 40.00th=[ 2192], 50.00th=[ 2352], 60.00th=[ 2512],
     | 70.00th=[ 2704], 80.00th=[ 2928], 90.00th=[ 3248], 95.00th=[ 3536],
     | 99.00th=[ 4320], 99.50th=[ 4704], 99.90th=[ 6048], 99.95th=[16192],
     | 99.99th=[19072]
   bw (  KiB/s): min=227734, max=1409824, per=2.43%, avg=809129.85, stdev=233993.38, samples=1888
   iops        : min=56933, max=352456, avg=202282.08, stdev=58498.35, samples=1888
  lat (nsec)   : 250=0.03%, 500=0.10%, 750=0.34%, 1000=1.27%
  lat (usec)   : 2=27.45%, 4=68.86%, 10=1.88%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 250=0.01%
  cpu          : usr=74.98%, sys=0.02%, ctx=16677, majf=0, minf=39248
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=249323829,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=20070: Thu Apr 19 11:19:13 2018
  write: IOPS=6500k, BW=24.8GiB/s (26.6GB/s)(744GiB/30001msec)
    clat (nsec): min=271, max=40004k, avg=4274.78, stdev=131308.65
     lat (nsec): min=296, max=40004k, avg=4343.37, stdev=132442.44
    clat percentiles (nsec):
     |  1.00th=[  780],  5.00th=[ 1352], 10.00th=[ 1704], 20.00th=[ 2128],
     | 30.00th=[ 2480], 40.00th=[ 2768], 50.00th=[ 3088], 60.00th=[ 3408],
     | 70.00th=[ 3728], 80.00th=[ 4128], 90.00th=[ 4768], 95.00th=[ 5472],
     | 99.00th=[ 7072], 99.50th=[ 7712], 99.90th=[ 9280], 99.95th=[ 9920],
     | 99.99th=[13120]
   bw (  KiB/s): min=232819, max=1081974, per=2.56%, avg=666000.67, stdev=183120.59, samples=1888
   iops        : min=58204, max=270493, avg=166499.78, stdev=45780.15, samples=1888
  lat (nsec)   : 500=0.09%, 750=0.78%, 1000=1.30%
  lat (usec)   : 2=14.17%, 4=60.30%, 10=23.31%, 20=0.04%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=75.01%, sys=0.00%, ctx=17508, majf=0, minf=4450
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,194992960,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=2, jobs=32): err= 0: pid=20102: Thu Apr 19 11:19:13 2018
  write: IOPS=6488k, BW=24.8GiB/s (26.6GB/s)(743GiB/30002msec)
    clat (nsec): min=309, max=95985k, avg=4309.85, stdev=131635.60
     lat (nsec): min=341, max=95985k, avg=4378.64, stdev=132669.15
    clat percentiles (nsec):
     |  1.00th=[  828],  5.00th=[ 1416], 10.00th=[ 1752], 20.00th=[ 2160],
     | 30.00th=[ 2512], 40.00th=[ 2800], 50.00th=[ 3088], 60.00th=[ 3408],
     | 70.00th=[ 3760], 80.00th=[ 4192], 90.00th=[ 4832], 95.00th=[ 5536],
     | 99.00th=[ 7136], 99.50th=[ 7776], 99.90th=[ 9408], 99.95th=[10176],
     | 99.99th=[13376]
   bw (  KiB/s): min=200075, max=1071670, per=2.71%, avg=702870.52, stdev=192996.80, samples=1888
   iops        : min=50018, max=267917, avg=175717.28, stdev=48249.20, samples=1888
  lat (nsec)   : 500=0.05%, 750=0.63%, 1000=1.13%
  lat (usec)   : 2=13.70%, 4=60.66%, 10=23.77%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=75.00%, sys=0.00%, ctx=17480, majf=0, minf=4486
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,194657811,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=3, jobs=32): err= 0: pid=20134: Thu Apr 19 11:19:13 2018
   read: IOPS=11.1M, BW=42.2GiB/s (45.4GB/s)(1267GiB/30001msec)
    clat (nsec): min=126, max=48017k, avg=2271.04, stdev=97483.46
     lat (nsec): min=164, max=48018k, avg=2342.17, stdev=98854.81
    clat percentiles (nsec):
     |  1.00th=[  229],  5.00th=[  266], 10.00th=[  342], 20.00th=[  716],
     | 30.00th=[ 1272], 40.00th=[ 1592], 50.00th=[ 1800], 60.00th=[ 1992],
     | 70.00th=[ 2192], 80.00th=[ 2384], 90.00th=[ 2704], 95.00th=[ 2960],
     | 99.00th=[ 3632], 99.50th=[ 3984], 99.90th=[ 5600], 99.95th=[ 7392],
     | 99.99th=[18560]
   bw (  MiB/s): min=  169, max= 4575, per=3.13%, avg=1351.89, stdev=776.67, samples=1888
   iops        : min=43282, max=1171328, avg=346083.39, stdev=198826.31, samples=1888
  lat (nsec)   : 250=2.67%, 500=13.08%, 750=4.72%, 1000=3.82%
  lat (usec)   : 2=35.93%, 4=39.28%, 10=0.45%, 20=0.04%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=74.88%, sys=0.13%, ctx=16894, majf=0, minf=387208
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=332230071,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=31.7GiB/s (34.0GB/s), 31.7GiB/s-31.7GiB/s (34.0GB/s-34.0GB/s), io=951GiB (1021GB), run=30002-30002msec

Run status group 1 (all jobs):
  WRITE: bw=24.8GiB/s (26.6GB/s), 24.8GiB/s-24.8GiB/s (26.6GB/s-26.6GB/s), io=744GiB (799GB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=24.8GiB/s (26.6GB/s), 24.8GiB/s-24.8GiB/s (26.6GB/s-26.6GB/s), io=743GiB (797GB), run=30002-30002msec

Run status group 3 (all jobs):
   READ: bw=42.2GiB/s (45.4GB/s), 42.2GiB/s-42.2GiB/s (45.4GB/s-45.4GB/s), io=1267GiB (1361GB), run=30001-30001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%